In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
ser1 = Series([1,2,3,4], index={'A','B','C','D'})

In [4]:
ser1

D    1
A    2
C    3
B    4
dtype: int64

In [5]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])

In [6]:
ser2

A    2.0
B    4.0
C    3.0
D    1.0
E    NaN
F    NaN
dtype: float64

In [9]:
ser2.reindex(['A','B','C','D','E','F','G','J'],fill_value=0)

A    2.0
B    4.0
C    3.0
D    1.0
E    NaN
F    NaN
G    0.0
J    0.0
dtype: float64

In [10]:
ser3 = Series(['USA','Mexico','Canada'], index=[0,5,10])

In [11]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [13]:
ser3.reindex(range(15),method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [15]:
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'], columns=['col1','col2','col3','col4','col5'])

In [16]:
dframe

       col1      col2      col3      col4      col5
A  1.557988 -0.045025 -0.888499  0.692974  0.160189
B -2.684408  0.413327  1.596582 -2.644218 -0.088633
D -1.200755 -0.372484 -0.649408 -0.633914 -1.786273
E -0.863706 -0.709853  0.220868  0.212245  0.015853
F -1.822528 -0.885721  0.512622 -1.199571  0.673172

In [17]:
new_index = ['A','B','C','D','E','F']

In [18]:
dframe2 = dframe.reindex(new_index)

In [19]:
dframe2

       col1      col2      col3      col4      col5
A  1.557988 -0.045025 -0.888499  0.692974  0.160189
B -2.684408  0.413327  1.596582 -2.644218 -0.088633
C       NaN       NaN       NaN       NaN       NaN
D -1.200755 -0.372484 -0.649408 -0.633914 -1.786273
E -0.863706 -0.709853  0.220868  0.212245  0.015853
F -1.822528 -0.885721  0.512622 -1.199571  0.673172

In [22]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [28]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  1.557988 -0.045025 -0.888499  0.692974  0.160189   NaN
B -2.684408  0.413327  1.596582 -2.644218 -0.088633   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.200755 -0.372484 -0.649408 -0.633914 -1.786273   NaN
E -0.863706 -0.709853  0.220868  0.212245  0.015853   NaN
F -1.822528 -0.885721  0.512622 -1.199571  0.673172   NaN

In [29]:
dframe

       col1      col2      col3      col4      col5
A  1.557988 -0.045025 -0.888499  0.692974  0.160189
B -2.684408  0.413327  1.596582 -2.644218 -0.088633
D -1.200755 -0.372484 -0.649408 -0.633914 -1.786273
E -0.863706 -0.709853  0.220868  0.212245  0.015853
F -1.822528 -0.885721  0.512622 -1.199571  0.673172

In [31]:
dframe.ix[new_index, new_columns]

       col1      col2      col3      col4      col5  col6
A  1.557988 -0.045025 -0.888499  0.692974  0.160189   NaN
B -2.684408  0.413327  1.596582 -2.644218 -0.088633   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.200755 -0.372484 -0.649408 -0.633914 -1.786273   NaN
E -0.863706 -0.709853  0.220868  0.212245  0.015853   NaN
F -1.822528 -0.885721  0.512622 -1.199571  0.673172   NaN